; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite6 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite7 - satellite
	instrument13 - instrument
	instrument14 - instrument
	spectrograph2 - mode
	image1 - mode
	image3 - mode
	thermograph0 - mode
	GroundStation0 - direction
	GroundStation4 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	Star1 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star1)
	(supports instrument3 thermograph0)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation5)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(supports instrument4 image3)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 GroundStation5)
	(supports instrument5 thermograph0)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 spectrograph2)
	(supports instrument6 image3)
	(calibration_target instrument6 Star3)
	(calibration_target instrument6 Star1)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
	(supports instrument7 image3)
	(calibration_target instrument7 GroundStation2)
	(calibration_target instrument7 Star3)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star8)
	(supports instrument8 image1)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star1)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 thermograph0)
	(supports instrument9 image1)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 GroundStation5)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star11)
	(supports instrument10 image3)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 GroundStation4)
	(supports instrument11 thermograph0)
	(calibration_target instrument11 Star1)
	(calibration_target instrument11 GroundStation2)
	(supports instrument12 image3)
	(calibration_target instrument12 Star3)
	(calibration_target instrument12 GroundStation4)
	(on_board instrument10 satellite6)
	(on_board instrument11 satellite6)
	(on_board instrument12 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star3)
	(supports instrument13 image3)
	(calibration_target instrument13 GroundStation5)
	(calibration_target instrument13 GroundStation2)
	(supports instrument14 image3)
	(supports instrument14 spectrograph2)
	(calibration_target instrument14 Star1)
	(calibration_target instrument14 GroundStation2)
	(on_board instrument13 satellite7)
	(on_board instrument14 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Star11)
)
(:goal (and
	(pointing satellite4 Star8)
	(pointing satellite5 GroundStation5)
	(pointing satellite6 Star6)
	(pointing satellite7 Star6)
	(have_image Star6 spectrograph2)
	(have_image Planet7 spectrograph2)
	(have_image Star8 image3)
	(have_image Planet9 image3)
	(have_image Phenomenon10 image3)
	(have_image Star11 thermograph0)
	(have_image Star12 spectrograph2)
))

)

; plan
1. (turn_to satellite7 groundstation2 star11)
   deleted: (pointing satellite7 star11)
   added: (pointing satellite7 groundstation2)
   goals met: 1 of 11
2. (switch_on instrument14 satellite7)
   deleted: (power_avail satellite7)
   added: (power_on instrument14)
   goals met: 1 of 11
3. (calibrate satellite7 instrument14 groundstation2)
   added: (calibrated instrument14)
   goals met: 1 of 11
4. (turn_to satellite7 planet9 groundstation2)
   deleted: (pointing satellite7 groundstation2)
   added: (pointing satellite7 planet9)
   goals met: 1 of 11
5. (take_image satellite7 planet9 instrument14 image3)
   added: (have_image planet9 image3)
   goals met: 2 of 11
6. (turn_to satellite7 planet7 planet9)
   deleted: (pointing satellite7 planet9)
   added: (pointing satellite7 planet7)
   goals met: 2 of 11
7. (take_image satellite7 planet7 instrument14 spectrograph2)
   added: (have_image planet7 spectrograph2)
   goals met: 3 of 11
8. (turn_to satellite7 phenomenon10 planet7)
   deleted: (pointing satellite7 planet7)
   added: (pointing satellite7 phenomenon10)
   goals met: 3 of 11
9. (turn_to satellite6 star6 star3)
   deleted: (pointing satellite6 star3)
   added: (pointing satellite6 star6)
   goals met: 4 of 11
10. (turn_to satellite5 groundstation5 star11)
   deleted: (pointing satellite5 star11)
   added: (pointing satellite5 groundstation5)
   goals met: 5 of 11
11. (take_image satellite7 phenomenon10 instrument14 image3)
   added: (have_image phenomenon10 image3)
   goals met: 6 of 11
12. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 6 of 11
13. (calibrate satellite3 instrument5 groundstation4)
   added: (calibrated instrument5)
   goals met: 6 of 11
14. (turn_to satellite3 star11 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 star11)
   goals met: 6 of 11
15. (take_image satellite3 star11 instrument5 thermograph0)
   added: (have_image star11 thermograph0)
   goals met: 7 of 11
16. (turn_to satellite3 star12 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star12)
   goals met: 7 of 11
17. (take_image satellite3 star12 instrument5 spectrograph2)
   added: (have_image star12 spectrograph2)
   goals met: 8 of 11
18. (turn_to satellite7 star8 phenomenon10)
   deleted: (pointing satellite7 phenomenon10)
   added: (pointing satellite7 star8)
   goals met: 8 of 11
19. (take_image satellite7 star8 instrument14 image3)
   added: (have_image star8 image3)
   goals met: 9 of 11
20. (turn_to satellite7 star6 star8)
   deleted: (pointing satellite7 star8)
   added: (pointing satellite7 star6)
   goals met: 10 of 11
21. (take_image satellite7 star6 instrument14 spectrograph2)
   added: (have_image star6 spectrograph2)
   goals met: 11 of 11
